var poets_dataset = {
    "柳树": {
        "爱情": [
            "《竹枝词九首》    ——刘禹锡",
            "《长恨歌》    ——白居易",
            "《懊恼曲》    ——温庭筠",
            "《题柳》    ——温庭筠",
            "《女冠子·昨夜夜半》    ——韦庄"
        ],
        "赞美": [
            "《奉和春日幸望春宫应制》    ——苏颋",
            "《戏赠郑溧阳》    ——李白",
            "《送客之江宁》    ——韩翃",
            "《观郑州崔郎中诸妓绣样 》    ——胡令能",
            "《段太尉逸事状》    ——柳宗元"
        ],
        "友情": [
            "《渭城曲 》    ——王维",
            "《下途归石门旧居》    ——李白",
            "《武威春暮闻宇文判官西使还已到晋昌》    ——岑参",
            "《东平别前卫县李寀少府 》    ——高适",
            "《夜别韦司士》    ——高适"
        ],
        "励志": [
            "《少年行四首》    ——王维"
        ],
        "闲适": [
            "《戏赠郑溧阳》    ——李白"
        ],
        "抒怀": [
            "《浩歌》    ——李贺",
            "《陪姚使君题惠上人房》    ——孟浩然",
            "《流夜郎赠辛判官》    ——李白",
            "《春游南亭》    ——韦应物",
            "《题平阳郡汾桥边柳树》    ——岑参"
        ],
        "思乡": [
            "《途中寒食题黄梅临江驿寄崔融》    ——宋之问",
            "《新年作》    ——刘长卿",
            "《和晋陵陆丞早春游望》    ——杜审言",
            "《凉州词二首》    ——王翰",
            "《春夜洛城闻笛 》    ——李白"
        ],
        "思念": [
            "《春日京中有怀》    ——杜审言",
            "《送沈子归江东 》    ——王维",
            "《早春寄王汉阳》    ——李白",
            "《人日寄杜二拾遗》    ——高适",
            "《襄阳寒食寄宇文籍》    ——窦巩"
        ],
        "送别": [
            "《送二兄入蜀》    ——卢照邻",
            "《送郑少府入辽共赋侠客远从戎》    ——骆宾王",
            "《奉和幸望春宫送朔方大总管张仁亶》    ——郑愔",
            "《送丘为落第归江东》    ——王维",
            "《送赵都督赴代州得青字》    ——王维"
        ],
        "孤寂": [
            "《从崔中丞过卢少尹郊居》    ——柳宗元"
        ],
        "愁苦": [],
        "忧国忧民": [
            "《上之回》    ——李白",
            "《自淇涉黄河途中作十三首》    ——高适"
        ],
        "咏史怀古": [
            "《长安古意》    ——卢照邻",
            "《过五丈原 》    ——温庭筠",
            "《台城》    ——韦庄"
        ],
        "壮志难酬": [
            "《送元暠师诗》    ——柳宗元"
        ],
        "讽刺": [
            "《寒食 》    ——韩翃",
            "《春日五门西望》    ——王建",
            "《经炀帝行宫》    ——刘沧",
            "《柳含烟·隋堤柳》    ——毛文锡"
        ]
    },
    "桃李": {
        "爱情": [
            "《长干行二首》    ——李白",
            "《竹枝词九首》    ——刘禹锡",
            "《长恨歌》    ——白居易"
        ],
        "赞美": [
            "《咏桂》    ——李白",
            "《奉和令公绿野堂种花》    ——白居易"
        ],
        "友情": [
            "《箜篌谣》    ——李白",
            "《赠汪伦》    ——李白",
            "《与李十二白同寻范十隐居》    ——杜甫",
            "《编集拙诗成一十五卷因题卷末戏赠元九、李二十》    ——白居易"
        ],
        "励志": [
            "《行路难三首》    ——李白",
            "《赠韦侍御黄裳二首》    ——李白",
            "《滕王阁序》    ——王勃"
        ],
        "闲适": [
            "《寒食城东即事》    ——王维"
        ],
        "抒怀": [
            "《流夜郎赠辛判官》    ——李白",
            "《江夏赠韦南陵冰》    ——李白",
            "《觉衰》    ——柳宗元",
            "《编集拙诗成一十五卷因题卷末戏赠元九、李二十》    ——白居易",
            "《念昔游三首》    ——杜牧"
        ],
        "思乡": [],
        "思念": [
            "《长干行二首》    ——李白"
        ],
        "送别": [
            "《送魏郡李太守赴任》    ——王维",
            "《赠汪伦》    ——李白",
            "《颍阳别元丹丘之淮阳》    ——李白",
            "《送王屋山人魏万还王屋·并序》    ——李白",
            "《送浑将军出塞》    ——高适"
        ],
        "孤寂": [],
        "愁苦": [],
        "忧国忧民": [
            "《上之回》    ——李白"
        ],
        "咏史怀古": [
            "《长安古意》    ——卢照邻",
            "《滕王阁序》    ——王勃"
        ],
        "壮志难酬": [],
        "讽刺": [
            "《赠卖松人》    ——于武陵"
        ]
    },
    "杨树": {
        "爱情": [
            "《钓鱼湾》    ——储光羲",
            "《雉朝飞》    ——李白",
            "《竹枝词九首》    ——刘禹锡",
            "《长恨歌》    ——白居易",
            "《无题四首》    ——李商隐"
        ],
        "赞美": [
            "《宣城送刘副使入秦》    ——李白"
        ],
        "友情": [
            "《闻王昌龄左迁龙标遥有此寄》    ——李白",
            "《忆旧游寄谯郡元参军》    ——李白",
            "《之广陵宿常二南郭幽居》    ——李白",
            "《下途归石门旧居》    ——李白",
            "《东平别前卫县李寀少府 》    ——高适"
        ],
        "励志": [
            "《滕王阁序》    ——王勃",
            "《戏为六绝句·其二》    ——杜甫"
        ],
        "闲适": [
            "《寒食城东即事》    ——王维"
        ],
        "抒怀": [
            "《浩歌》    ——李贺",
            "《长歌行》    ——王昌龄",
            "《赠钱征君少阳》    ——李白",
            "《别韦参军》    ——高适",
            "《残丝曲》    ——李贺"
        ],
        "思乡": [
            "《凉州词二首》    ——王翰",
            "《闻王昌龄左迁龙标遥有此寄》    ——李白",
            "《春兴》    ——武元衡",
            "《寒食野望吟》    ——白居易",
            "《凉州词二首·其一》    ——王之涣"
        ],
        "思念": [
            "《送沈子归江东 》    ——王维",
            "《折杨柳》    ——李白",
            "《早春寄王汉阳》    ——李白",
            "《无题·凤尾香罗薄几重》    ——李商隐"
        ],
        "送别": [
            "《奉和幸望春宫送朔方大总管张仁亶》    ——郑愔",
            "《送沈子归江东 》    ——王维",
            "《送宇文六》    ——常建",
            "《高阳池送朱二》    ——孟浩然",
            "《送杨子》    ——岑参"
        ],
        "孤寂": [
            "《洞庭阻风》    ——许棠"
        ],
        "愁苦": [
            "《送宇文六》    ——常建"
        ],
        "忧国忧民": [
            "《猛虎行》    ——李白",
            "《新丰折臂翁》    ——白居易"
        ],
        "咏史怀古": [
            "《滕王阁序》    ——王勃"
        ],
        "壮志难酬": [],
        "讽刺": [
            "《上留田行》    ——李白",
            "《丽人行》    ——杜甫",
            "《隋宫》    ——李商隐",
            "《春江花月夜词》    ——温庭筠"
        ]
    },
    "茶": {
        "爱情": [
            "《大堤曲》    ——李贺",
            "《无题四首》    ——李商隐",
            "《菩萨蛮·铜簧韵脆锵寒竹》    ——李煜"
        ],
        "赞美": [
            "《和陆明府赠将军重出塞》    ——陈子昂",
            "《兴庆池侍宴应制》    ——沈佺期",
            "《赠丹阳横山周处士惟长》    ——李白",
            "《宣城送刘副使入秦》    ——李白",
            "《田使君美人舞如莲花北鋋歌》    ——岑参"
        ],
        "友情": [
            "《忆旧游寄谯郡元参军》    ——李白",
            "《送友人》    ——李白",
            "《至鸭栏驿上白马矶赠裴侍御》    ——李白",
            "《送宗判官归滑台序》    ——任华"
        ],
        "励志": [
            "《赠韦秘书子春二首》    ——李白",
            "《冬日归旧山》    ——李白"
        ],
        "闲适": [
            "《与赵莒茶宴》    ——钱起",
            "《夏昼偶作》    ——柳宗元",
            "《夜闻贾常州崔湖州茶山境会亭欢宴》    ——白居易",
            "《三堂东湖作》    ——韦庄"
        ],
        "抒怀": [
            "《度峡口山赠乔补阙知之王二无竞》    ——陈子昂",
            "《进艇》    ——杜甫",
            "《构法华寺西亭》    ——柳宗元",
            "《感遇二首》    ——柳宗元",
            "《秋怀十五首》    ——孟郊"
        ],
        "思乡": [
            "《登襄阳城》    ——杜审言",
            "《峨眉山月歌送蜀僧晏入中京》    ——李白",
            "《奉陪封大夫九日登高》    ——岑参",
            "《从军北征》    ——李益",
            "《首春逢耕者》    ——柳宗元"
        ],
        "思念": [
            "《长相思三首》    ——李白",
            "《长相思三首·其二》    ——李白",
            "《长相思·其二》    ——李白",
            "《代赠二首·其一》    ——李商隐"
        ],
        "送别": [
            "《江亭夜月送别二首》    ——王勃",
            "《送魏大从军》    ——陈子昂",
            "《和陆明府赠将军重出塞》    ——陈子昂",
            "《送王屋山人魏万还王屋·并序》    ——李白",
            "《送友人寻越中山水》    ——李白"
        ],
        "孤寂": [],
        "愁苦": [
            "《构法华寺西亭》    ——柳宗元"
        ],
        "忧国忧民": [
            "《金陵望汉江》    ——李白",
            "《新安吏》    ——杜甫",
            "《海人谣》    ——王建",
            "《吊古战场文》    ——李华"
        ],
        "咏史怀古": [
            "《长安古意》    ——卢照邻",
            "《登襄阳城》    ——杜审言",
            "《登广武古战场怀古》    ——李白"
        ],
        "壮志难酬": [],
        "讽刺": [
            "《杜侍御送贡物戏赠》    ——张谓",
            "《效古赠崔二》    ——高适",
            "《塞上曲二首》    ——戴叔伦",
            "《古东门行》    ——柳宗元",
            "《柳含烟·隋堤柳》    ——毛文锡"
        ]
    },
    "莲": {
        "爱情": [
            "《钓鱼湾》    ——储光羲",
            "《西施 》    ——李白",
            "《采莲子二首》    ——皇甫松",
            "《大堤曲》    ——李贺",
            "《长恨歌》    ——白居易"
        ],
        "赞美": [
            "《题大禹寺义公禅房》    ——孟浩然",
            "《早秋赠裴十七仲堪》    ——李白",
            "《田使君美人舞如莲花北鋋歌》    ——岑参",
            "《赠荷花》    ——李商隐"
        ],
        "友情": [
            "《夏日南亭怀辛大》    ——孟浩然",
            "《魏郡别苏明府因北游》    ——李白"
        ],
        "励志": [],
        "闲适": [
            "《皇甫岳云溪杂题五首·莲花坞》    ——王维",
            "《池上二绝》    ——白居易",
            "《三堂东湖作》    ——韦庄"
        ],
        "抒怀": [
            "《奉和圣制重阳赐会聊示所怀》    ——李泌",
            "《无家别》    ——杜甫",
            "《喜达行在所三首》    ——杜甫",
            "《进艇》    ——杜甫",
            "《柳州峒氓》    ——柳宗元"
        ],
        "思乡": [
            "《游九龙潭》    ——武则天",
            "《奉陪封大夫九日登高》    ——岑参",
            "《维扬冬末寄幕中二从事》    ——王建"
        ],
        "思念": [
            "《和微之四月一日作》    ——白居易",
            "《暮秋独游曲江》    ——李商隐",
            "《无题·来是空言去绝踪》    ——李商隐"
        ],
        "送别": [
            "《送灵澈上人》    ——刘长卿",
            "《高阳池送朱二》    ——孟浩然",
            "《西岳云台歌送丹丘子》    ——李白",
            "《送温处士归黄山白鹅峰旧居》    ——李白",
            "《送人》    ——杜牧"
        ],
        "孤寂": [
            "《湘岸移木芙蓉植龙兴精舍》    ——柳宗元"
        ],
        "愁苦": [
            "《湘岸移木芙蓉植龙兴精舍》    ——柳宗元"
        ],
        "忧国忧民": [
            "《夏夜叹》    ——杜甫",
            "《秋兴八首》    ——杜甫"
        ],
        "咏史怀古": [
            "《长安古意》    ——卢照邻",
            "《西施 》    ——李白"
        ],
        "壮志难酬": [
            "《戏题石门长老东轩》    ——柳宗元",
            "《七月二十九日崇让宅宴作》    ——李商隐"
        ],
        "讽刺": [
            "《口号吴王美人半醉》    ——李白",
            "《效古赠崔二》    ——高适",
            "《牧童词》    ——李涉",
            "《春江花月夜词》    ——温庭筠",
            "《为徐敬业讨武曌檄 》    ——骆宾王"
        ]
    },
    "飞蓬": {
        "爱情": [
            "《长恨歌》    ——白居易",
            "《无题二首》    ——李商隐",
            "《无题四首》    ——李商隐",
            "《无题·相见时难别亦难》    ——李商隐",
            "《无题·来是空言去绝踪》    ——李商隐"
        ],
        "赞美": [
            "《使至塞上》    ——王维",
            "《野人送朱樱》    ——杜甫"
        ],
        "友情": [
            "《赠从兄襄阳少府皓》    ——李白",
            "《鲁郡东石门送杜二甫》    ——李白",
            "《送友人》    ——李白",
            "《天台晓望》    ——李白",
            "《哭晁卿衡》    ——李白"
        ],
        "励志": [
            "《赠韦秘书子春二首》    ——李白",
            "《小松》    ——杜荀鹤"
        ],
        "闲适": [],
        "抒怀": [
            "《宣州谢脁楼饯别校书叔云》    ——李白",
            "《新植海石榴》    ——柳宗元",
            "《秋怀十五首》    ——孟郊",
            "《菊》    ——郑谷",
            "《游子吟》    ——陈陶"
        ],
        "思乡": [
            "《郢门秋怀》    ——李白",
            "《八月十五夜月二首》    ——杜甫",
            "《游朝阳岩遂登西亭二十韵》    ——柳宗元",
            "《望月有感》    ——白居易"
        ],
        "思念": [
            "《巩北秋兴寄崔明允》    ——岑参",
            "《无题·相见时难别亦难》    ——李商隐",
            "《无题·来是空言去绝踪》    ——李商隐"
        ],
        "送别": [
            "《西岳云台歌送丹丘子》    ——李白",
            "《鲁郡东石门送杜二甫》    ——李白",
            "《送友人》    ——李白",
            "《送李侍御赴安西》    ——高适",
            "《送孔巢父谢病归游江东兼呈李白》    ——杜甫"
        ],
        "孤寂": [],
        "愁苦": [],
        "忧国忧民": [
            "《穆陵关北逢人归渔阳》    ——刘长卿",
            "《北征》    ——杜甫",
            "《秋兴八首》    ——杜甫",
            "《风疾舟中伏枕书怀三十六韵奉呈湖南亲友》    ——杜甫",
            "《山中寡妇 》    ——杜荀鹤"
        ],
        "咏史怀古": [
            "《梁甫吟》    ——李白",
            "《登广武古战场怀古》    ——李白",
            "《题武关》    ——杜牧"
        ],
        "壮志难酬": [],
        "讽刺": [
            "《上留田行》    ——李白",
            "《胡旋女》    ——白居易",
            "《牧童词》    ——李涉",
            "《新沙》    ——陆龟蒙"
        ]
    },
    "梁": {
        "爱情": [
            "《双燕离》    ——李白",
            "《无题四首》    ——李商隐",
            "《可叹》    ——李商隐",
            "《忆江南·衔泥燕》    ——牛峤",
            "《忆江南·衔泥燕》    ——牛峤"
        ],
        "赞美": [
            "《宋中送族侄式颜》    ——高适",
            "《段太尉逸事状》    ——柳宗元"
        ],
        "友情": [
            "《箜篌谣》    ——李白",
            "《东平别前卫县李寀少府 》    ——高适",
            "《寄李十二白二十韵》    ——杜甫",
            "《同李十一醉忆元九》    ——白居易",
            "《寄令狐郎中》    ——李商隐"
        ],
        "励志": [
            "《滕王阁序》    ——王勃"
        ],
        "闲适": [],
        "抒怀": [
            "《与东方左史虬修竹篇》    ——陈子昂",
            "《咏山樽二首》    ——李白",
            "《别韦参军》    ——高适",
            "《咏怀二首》    ——李贺",
            "《忆江南·衔泥燕》    ——牛峤"
        ],
        "思乡": [
            "《望月有感》    ——白居易"
        ],
        "思念": [
            "《古意呈补阙乔知之 》    ——沈佺期",
            "《同李十一醉忆元九》    ——白居易",
            "《寄令狐郎中》    ——李商隐"
        ],
        "送别": [
            "《送王屋山人魏万还王屋·并序》    ——李白",
            "《宋中送族侄式颜》    ——高适",
            "《东平别前卫县李寀少府 》    ——高适"
        ],
        "孤寂": [
            "《更漏子·春夜阑》    ——毛文锡"
        ],
        "愁苦": [
            "《咏怀二首》    ——李贺"
        ],
        "忧国忧民": [
            "《猛虎行》    ——李白",
            "《自京赴奉先县咏怀五百字 》    ——杜甫",
            "《登楼》    ——杜甫",
            "《杜陵叟》    ——白居易",
            "《古风二首 》    ——李绅"
        ],
        "咏史怀古": [
            "《长安古意》    ——卢照邻",
            "《梁甫吟》    ——李白",
            "《筹笔驿》    ——李商隐",
            "《滕王阁序》    ——王勃"
        ],
        "壮志难酬": [],
        "讽刺": [
            "《为徐敬业讨武曌檄 》    ——骆宾王"
        ]
    },
    "泽兰": {
        "爱情": [
            "《长干行二首》    ——李白",
            "《竹枝词九首》    ——刘禹锡",
            "《无题二首》    ——李商隐",
            "《懊恼曲》    ——温庭筠",
            "《无题·昨夜星辰昨夜风》    ——李商隐"
        ],
        "赞美": [
            "《和陆明府赠将军重出塞》    ——陈子昂",
            "《客中行 》    ——李白",
            "《罗浮山父与葛篇》    ——李贺",
            "《嘲春风》    ——温庭筠"
        ],
        "友情": [
            "《赠友人三首》    ——李白",
            "《寄韩潮州愈》    ——贾岛"
        ],
        "励志": [
            "《滕王阁序》    ——王勃"
        ],
        "闲适": [],
        "抒怀": [
            "《赠别王十七管记》    ——高适",
            "《开愁歌》    ——李贺",
            "《进学解》    ——韩愈"
        ],
        "思乡": [
            "《寒食江州满塘驿》    ——宋之问",
            "《夕次蒲类津 》    ——骆宾王",
            "《庭前菊》    ——韦庄"
        ],
        "思念": [
            "《长干行二首》    ——李白",
            "《从军行七首》    ——王昌龄",
            "《春思》    ——李白",
            "《忆江上吴处士》    ——贾岛",
            "《阳台梦·薄罗衫子金泥凤》    ——李存勖"
        ],
        "送别": [
            "《和陆明府赠将军重出塞》    ——陈子昂",
            "《送裴十八图南归嵩山二首》    ——李白",
            "《赠别王十七管记》    ——高适",
            "《忆江上吴处士》    ——贾岛"
        ],
        "孤寂": [],
        "愁苦": [],
        "忧国忧民": [
            "《伤心行》    ——李贺"
        ],
        "咏史怀古": [
            "《滕王阁序》    ——王勃"
        ],
        "壮志难酬": [],
        "讽刺": [
            "《效古赠崔二》    ——高适",
            "《柳含烟·隋堤柳》    ——毛文锡"
        ]
    },
    "木樨": {
        "爱情": [
            "《大堤曲》    ——李贺",
            "《无题二首》    ——李商隐",
            "《无题·重帏深下莫愁堂》    ——李商隐",
            "《无题·昨夜星辰昨夜风》    ——李商隐"
        ],
        "赞美": [
            "《咏桂》    ——李白",
            "《赋得还山吟送沈四山人》    ——高适"
        ],
        "友情": [
            "《送綦毋潜落第还乡 》    ——王维",
            "《忆旧游寄谯郡元参军》    ——李白",
            "《再授连州至衡阳酬柳柳州赠别》    ——刘禹锡",
            "《送宗判官归滑台序》    ——任华"
        ],
        "励志": [
            "《滕王阁序》    ——王勃"
        ],
        "闲适": [],
        "抒怀": [
            "《柳州寄丈人周韶州》    ——柳宗元",
            "《秋怀十五首》    ——孟郊",
            "《帝子歌》    ——李贺",
            "《长安夜雨》    ——薛逢"
        ],
        "思乡": [
            "《八月十五夜月二首》    ——杜甫",
            "《十五夜望月寄杜郎中》    ——王建"
        ],
        "思念": [
            "《谢赐珍珠》    ——江采萍",
            "《一百五日夜对月》    ——杜甫",
            "《秋夜曲》    ——王维",
            "《无题·重帏深下莫愁堂》    ——李商隐"
        ],
        "送别": [
            "《送綦毋潜落第还乡 》    ——王维",
            "《送任五之桂林》    ——王昌龄",
            "《送温处士归黄山白鹅峰旧居》    ——李白",
            "《送饯从叔辞丰州幕归嵩阳旧居》    ——卢纶",
            "《送桂州严大夫同用南字》    ——韩愈"
        ],
        "孤寂": [
            "《拟小山篇》    ——徐惠",
            "《柳州寄丈人周韶州》    ——柳宗元"
        ],
        "愁苦": [
            "《柳州寄丈人周韶州》    ——柳宗元"
        ],
        "忧国忧民": [],
        "咏史怀古": [
            "《长安古意》    ——卢照邻",
            "《滕王阁序》    ——王勃"
        ],
        "壮志难酬": [],
        "讽刺": [
            "《帝子歌》    ——李贺"
        ]
    },
    "肉桂": {
        "爱情": [
            "《大堤曲》    ——李贺",
            "《无题二首》    ——李商隐",
            "《无题·重帏深下莫愁堂》    ——李商隐",
            "《无题·昨夜星辰昨夜风》    ——李商隐"
        ],
        "赞美": [
            "《咏桂》    ——李白",
            "《赋得还山吟送沈四山人》    ——高适"
        ],
        "友情": [
            "《送綦毋潜落第还乡 》    ——王维",
            "《忆旧游寄谯郡元参军》    ——李白",
            "《再授连州至衡阳酬柳柳州赠别》    ——刘禹锡",
            "《送宗判官归滑台序》    ——任华"
        ],
        "励志": [
            "《滕王阁序》    ——王勃"
        ],
        "闲适": [],
        "抒怀": [
            "《柳州寄丈人周韶州》    ——柳宗元",
            "《秋怀十五首》    ——孟郊",
            "《帝子歌》    ——李贺",
            "《长安夜雨》    ——薛逢"
        ],
        "思乡": [
            "《八月十五夜月二首》    ——杜甫",
            "《十五夜望月寄杜郎中》    ——王建"
        ],
        "思念": [
            "《谢赐珍珠》    ——江采萍",
            "《一百五日夜对月》    ——杜甫",
            "《秋夜曲》    ——王维",
            "《无题·重帏深下莫愁堂》    ——李商隐"
        ],
        "送别": [
            "《送綦毋潜落第还乡 》    ——王维",
            "《送任五之桂林》    ——王昌龄",
            "《送王屋山人魏万还王屋·并序》    ——李白",
            "《送温处士归黄山白鹅峰旧居》    ——李白",
            "《送饯从叔辞丰州幕归嵩阳旧居》    ——卢纶"
        ],
        "孤寂": [
            "《拟小山篇》    ——徐惠",
            "《柳州寄丈人周韶州》    ——柳宗元"
        ],
        "愁苦": [
            "《柳州寄丈人周韶州》    ——柳宗元"
        ],
        "忧国忧民": [],
        "咏史怀古": [
            "《长安古意》    ——卢照邻",
            "《滕王阁序》    ——王勃"
        ],
        "壮志难酬": [],
        "讽刺": [
            "《帝子歌》    ——李贺"
        ]
    },
    "桑树": {
        "爱情": [],
        "赞美": [
            "《陌上桑》    ——李白",
            "《子夜吴歌·春歌》    ——李白"
        ],
        "友情": [
            "《过故人庄》    ——孟浩然",
            "《登单父陶少府半月台》    ——李白",
            "《下途归石门旧居》    ——李白",
            "《送日本国僧敬龙归》    ——韦庄"
        ],
        "励志": [
            "《酬乐天咏老见示》    ——刘禹锡",
            "《滕王阁序》    ——王勃"
        ],
        "闲适": [],
        "抒怀": [
            "《纪南陵题五松山》    ——李白",
            "《自淇涉黄河途中作十三首》    ——高适",
            "《闻黄鹂》    ——柳宗元",
            "《野歌》    ——李贺"
        ],
        "思乡": [
            "《渡河到清河作》    ——王维",
            "《维扬冬末寄幕中二从事》    ——王建",
            "《闻黄鹂》    ——柳宗元",
            "《旅次朔方 》    ——刘皂"
        ],
        "思念": [
            "《春思》    ——李白",
            "《春闺思》    ——张仲素"
        ],
        "送别": [
            "《送郑少府入辽共赋侠客远从戎》    ——骆宾王",
            "《送秘书晁监还日本国》    ——王维",
            "《送日本国僧敬龙归》    ——韦庄"
        ],
        "孤寂": [],
        "愁苦": [],
        "忧国忧民": [
            "《穆陵关北逢人归渔阳》    ——刘长卿",
            "《战城南》    ——李白",
            "《自淇涉黄河途中作十三首》    ——高适",
            "《北征》    ——杜甫",
            "《岁晏行》    ——杜甫"
        ],
        "咏史怀古": [
            "《长安古意》    ——卢照邻",
            "《邺都引》    ——张说",
            "《滕王阁序》    ——王勃"
        ],
        "壮志难酬": [],
        "讽刺": [
            "《战城南》    ——李白",
            "《诸将五首》    ——杜甫",
            "《观祈雨》    ——李约",
            "《捕渔谣》    ——曹邺",
            "《采桑女》    ——唐彦谦"
        ]
    },
    "竹": {
        "爱情": [
            "《长干行二首》    ——李白",
            "《杂曲歌辞·春江曲》    ——郭元振",
            "《竹枝词九首》    ——刘禹锡",
            "《长恨歌》    ——白居易",
            "《菩萨蛮·铜簧韵脆锵寒竹》    ——李煜"
        ],
        "赞美": [
            "《咏王大娘戴竿》    ——刘晏",
            "《下泾县陵阳溪至涩滩》    ——李白",
            "《寄王舍人竹楼》    ——李嘉祐",
            "《宋中送族侄式颜》    ——高适",
            "《佳人》    ——杜甫"
        ],
        "友情": [
            "《送卢主簿》    ——王勃",
            "《夏日南亭怀辛大》    ——孟浩然",
            "《对雪奉饯任城六父秩满归京》    ——李白",
            "《谢公亭·盖谢脁范云之所游》    ——李白",
            "《云阳馆与韩绅宿别》    ——司空曙"
        ],
        "励志": [
            "《风》    ——李峤",
            "《冬日归旧山》    ——李白",
            "《茅屋为秋风所破歌》    ——杜甫",
            "《滕王阁序》    ——王勃"
        ],
        "闲适": [
            "《皇甫岳云溪杂题五首·莲花坞》    ——王维",
            "《寄王舍人竹楼》    ——李嘉祐",
            "《与赵莒茶宴》    ——钱起",
            "《夏昼偶作》    ——柳宗元",
            "《池上二绝》    ——白居易"
        ],
        "抒怀": [
            "《与东方左史虬修竹篇》    ——陈子昂",
            "《赠钱征君少阳》    ——李白",
            "《自淇涉黄河途中作十三首》    ——高适",
            "《金城北楼》    ——高适",
            "《秋怀十五首》    ——孟郊"
        ],
        "思乡": [
            "《游九龙潭》    ——武则天",
            "《都下送辛大之鄂》    ——孟浩然",
            "《桂州腊夜》    ——戎昱",
            "《庾楼晓望》    ——白居易",
            "《鹧鸪》    ——郑谷"
        ],
        "思念": [
            "《长干行二首》    ——李白",
            "《冬晚对雪忆胡居士家》    ——王维",
            "《竹窗闻风寄苗发司空曙》    ——李益",
            "《偶作寄朗之》    ——白居易",
            "《女冠子·露花烟草》    ——张泌"
        ],
        "送别": [
            "《送卢主簿》    ——王勃",
            "《送灵澈上人》    ——刘长卿",
            "《都下送辛大之鄂》    ——孟浩然",
            "《对雪奉饯任城六父秩满归京》    ——李白",
            "《宋中送族侄式颜》    ——高适"
        ],
        "孤寂": [
            "《暮春有感寄友人》    ——鱼玄机"
        ],
        "愁苦": [
            "《春归》    ——杜甫"
        ],
        "忧国忧民": [
            "《远别离》    ——李白",
            "《金陵望汉江》    ——李白",
            "《自淇涉黄河途中作十三首》    ——高适",
            "《茅屋为秋风所破歌》    ——杜甫"
        ],
        "咏史怀古": [
            "《八骏图》    ——白居易",
            "《咏史二首·其一》    ——李商隐",
            "《焚书坑》    ——章碣",
            "《滕王阁序》    ——王勃"
        ],
        "壮志难酬": [
            "《七月二十九日崇让宅宴作》    ——李商隐"
        ],
        "讽刺": [
            "《上留田行》    ——李白",
            "《八骏图》    ——白居易",
            "《瑶池》    ——李商隐",
            "《焚书坑》    ——章碣"
        ]
    },
    "梅": {
        "爱情": [
            "《长干行二首》    ——李白",
            "《有所思》    ——卢仝"
        ],
        "赞美": [
            "《田使君美人舞如莲花北鋋歌》    ——岑参",
            "《陪裴使君登岳阳楼》    ——杜甫"
        ],
        "友情": [
            "《岁除夜会乐城张少府宅》    ——孟浩然"
        ],
        "励志": [
            "《上堂开示颂》    ——黄蘖禅师"
        ],
        "闲适": [
            "《守岁》    ——李世民"
        ],
        "抒怀": [
            "《陪姚使君题惠上人房》    ——孟浩然",
            "《柳州寄丈人周韶州》    ——柳宗元",
            "《早梅》    ——柳宗元"
        ],
        "思乡": [
            "《题大庾岭北驿》    ——宋之问",
            "《和晋陵陆丞早春游望》    ——杜审言",
            "《与史郎中钦听黄鹤楼上吹笛 》    ——李白",
            "《杂诗三首·其二》    ——王维"
        ],
        "思念": [
            "《长干行二首》    ——李白",
            "《梅花落》    ——杨炯",
            "《杂诗三首 》    ——王维",
            "《早春寄王汉阳》    ——李白",
            "《人日寄杜二拾遗》    ——高适"
        ],
        "送别": [
            "《送王屋山人魏万还王屋·并序》    ——李白",
            "《送裴二虬作尉永嘉》    ——杜甫",
            "《巴陵夜别王八员外 》    ——贾至"
        ],
        "孤寂": [
            "《柳州寄丈人周韶州》    ——柳宗元"
        ],
        "愁苦": [
            "《柳州寄丈人周韶州》    ——柳宗元"
        ],
        "忧国忧民": [
            "《与史郎中钦听黄鹤楼上吹笛 》    ——李白"
        ],
        "咏史怀古": [],
        "壮志难酬": [],
        "讽刺": []
    },
    "地钱": {
        "爱情": [
            "《长干行二首》    ——李白"
        ],
        "赞美": [
            "《陋室铭》    ——刘禹锡"
        ],
        "友情": [],
        "励志": [
            "《冬日归旧山》    ——李白"
        ],
        "闲适": [
            "《敬酬李判官使院即事见呈》    ——岑参"
        ],
        "抒怀": [
            "《南轩松》    ——李白",
            "《新植海石榴》    ——柳宗元",
            "《秋怀十五首》    ——孟郊",
            "《润州二首》    ——杜牧",
            "《早雁》    ——杜牧"
        ],
        "思乡": [
            "《归雁》    ——钱起",
            "《端居》    ——李商隐"
        ],
        "思念": [
            "《长相思三首》    ——李白",
            "《长干行二首》    ——李白",
            "《久别离》    ——李白",
            "《听角思归》    ——顾况",
            "《竹窗闻风寄苗发司空曙》    ——李益"
        ],
        "送别": [],
        "孤寂": [
            "《正月崇让宅》    ——李商隐",
            "《八六子·洞房深》    ——杜牧"
        ],
        "愁苦": [
            "《春归》    ——杜甫"
        ],
        "忧国忧民": [],
        "咏史怀古": [],
        "壮志难酬": [],
        "讽刺": [
            "《春日五门西望》    ——王建",
            "《过勤政楼》    ——杜牧"
        ]
    },
    "香蒲": {
        "爱情": [
            "《大堤曲》    ——李贺"
        ],
        "赞美": [
            "《赠丹阳横山周处士惟长》    ——李白",
            "《寄王舍人竹楼》    ——李嘉祐",
            "《段太尉逸事状》    ——柳宗元"
        ],
        "友情": [],
        "励志": [],
        "闲适": [
            "《寒食城东即事》    ——王维",
            "《寄王舍人竹楼》    ——李嘉祐",
            "《夜闻贾常州崔湖州茶山境会亭欢宴》    ——白居易"
        ],
        "抒怀": [
            "《送辛大之鄂渚不及》    ——孟浩然",
            "《帝子歌》    ——李贺",
            "《安贫》    ——韩偓"
        ],
        "思乡": [
            "《秋浦途中》    ——杜牧"
        ],
        "思念": [],
        "送别": [
            "《送辛大之鄂渚不及》    ——孟浩然"
        ],
        "孤寂": [
            "《送辛大之鄂渚不及》    ——孟浩然",
            "《洞庭阻风》    ——许棠"
        ],
        "愁苦": [],
        "忧国忧民": [],
        "咏史怀古": [
            "《茂陵》    ——李商隐"
        ],
        "壮志难酬": [],
        "讽刺": [
            "《帝子歌》    ——李贺",
            "《茂陵》    ——李商隐"
        ]
    },
    "白茅": {
        "爱情": [],
        "赞美": [
            "《佳人》    ——杜甫"
        ],
        "友情": [
            "《寻西山隐者不遇 》    ——丘为",
            "《之广陵宿常二南郭幽居》    ——李白",
            "《题邻居》    ——于鹄"
        ],
        "励志": [
            "《茅屋为秋风所破歌》    ——杜甫"
        ],
        "闲适": [
            "《答张五弟》    ——王维"
        ],
        "抒怀": [
            "《淮上遇洛阳李主簿》    ——韦应物",
            "《小石城山记》    ——柳宗元"
        ],
        "思乡": [
            "《题稚川山水》    ——戴叔伦",
            "《商山早行》    ——温庭筠"
        ],
        "思念": [],
        "送别": [
            "《西岳云台歌送丹丘子》    ——李白",
            "《送区册序》    ——韩愈"
        ],
        "孤寂": [
            "《宿郑州》    ——王维"
        ],
        "愁苦": [
            "《春归》    ——杜甫"
        ],
        "忧国忧民": [
            "《北征》    ——杜甫",
            "《茅屋为秋风所破歌》    ——杜甫",
            "《岁晏行》    ——杜甫",
            "《水夫谣》    ——王建",
            "《山中寡妇 》    ——杜荀鹤"
        ],
        "咏史怀古": [],
        "壮志难酬": [],
        "讽刺": []
    },
    "梧桐": {
        "爱情": [
            "《省试湘灵鼓瑟》    ——钱起",
            "《长恨歌》    ——白居易"
        ],
        "赞美": [
            "《陌上桑》    ——李白"
        ],
        "友情": [
            "《登单父陶少府半月台》    ——李白",
            "《哭晁卿衡》    ——李白",
            "《哭李商隐》    ——崔珏"
        ],
        "励志": [],
        "闲适": [],
        "抒怀": [
            "《与东方左史虬修竹篇》    ——陈子昂",
            "《纪南陵题五松山》    ——李白",
            "《零陵春望》    ——柳宗元",
            "《秋怀十五首》    ——孟郊",
            "《咏史二首·其二》    ——李商隐"
        ],
        "思乡": [
            "《郢门秋怀》    ——李白"
        ],
        "思念": [
            "《奉寄韦太守陟》    ——王维",
            "《巩北秋兴寄崔明允》    ——岑参",
            "《别元九后咏所怀》    ——白居易",
            "《冬夜寄温飞卿》    ——鱼玄机",
            "《梧桐影·落日斜》    ——吕岩"
        ],
        "送别": [
            "《送陈章甫》    ——李颀"
        ],
        "孤寂": [
            "《别元九后咏所怀》    ——白居易",
            "《八六子·洞房深》    ——杜牧"
        ],
        "愁苦": [],
        "忧国忧民": [
            "《远别离》    ——李白",
            "《新秋夜寄诸弟》    ——韦应物",
            "《秋兴八首》    ——杜甫"
        ],
        "咏史怀古": [
            "《秋登宣城谢脁北楼》    ——李白"
        ],
        "壮志难酬": [],
        "讽刺": []
    },
    "桐花": {
        "爱情": [
            "《长恨歌》    ——白居易"
        ],
        "赞美": [],
        "友情": [
            "《哭李商隐》    ——崔珏"
        ],
        "励志": [],
        "闲适": [],
        "抒怀": [
            "《与东方左史虬修竹篇》    ——陈子昂",
            "《纪南陵题五松山》    ——李白",
            "《秋怀十五首》    ——孟郊"
        ],
        "思乡": [],
        "思念": [
            "《奉寄韦太守陟》    ——王维",
            "《巩北秋兴寄崔明允》    ——岑参",
            "《别元九后咏所怀》    ——白居易",
            "《冬夜寄温飞卿》    ——鱼玄机",
            "《梧桐影·落日斜》    ——吕岩"
        ],
        "送别": [
            "《送陈章甫》    ——李颀"
        ],
        "孤寂": [
            "《别元九后咏所怀》    ——白居易",
            "《八六子·洞房深》    ——杜牧"
        ],
        "愁苦": [],
        "忧国忧民": [],
        "咏史怀古": [
            "《秋登宣城谢脁北楼》    ——李白"
        ],
        "壮志难酬": [],
        "讽刺": []
    },
    "藜": {
        "爱情": [
            "《长恨歌》    ——白居易"
        ],
        "赞美": [
            "《马诗二十三首·其二》    ——李贺"
        ],
        "友情": [],
        "励志": [],
        "闲适": [],
        "抒怀": [
            "《送友人南归》    ——王维",
            "《宣州谢脁楼饯别校书叔云》    ——李白",
            "《无家别》    ——杜甫",
            "《感遇二首》    ——柳宗元",
            "《秋怀十五首》    ——孟郊"
        ],
        "思乡": [],
        "思念": [],
        "送别": [
            "《送友人南归》    ——王维",
            "《西岳云台歌送丹丘子》    ——李白",
            "《送孔巢父谢病归游江东兼呈李白》    ——杜甫",
            "《送韩十四江东觐省》    ——杜甫"
        ],
        "孤寂": [],
        "愁苦": [],
        "忧国忧民": [
            "《苦寒行》    ——齐己",
            "《秋兴八首》    ——杜甫",
            "《风疾舟中伏枕书怀三十六韵奉呈湖南亲友》    ——杜甫",
            "《庄居野行》    ——姚合"
        ],
        "咏史怀古": [],
        "壮志难酬": [],
        "讽刺": [
            "《新沙》    ——陆龟蒙"
        ]
    },
    "稻": {
        "爱情": [],
        "赞美": [],
        "友情": [
            "《寄李十二白二十韵》    ——杜甫"
        ],
        "励志": [],
        "闲适": [],
        "抒怀": [
            "《送友人南归》    ——王维",
            "《马诗二十三首》    ——李贺",
            "《早雁》    ——杜牧"
        ],
        "思乡": [],
        "思念": [
            "《和微之四月一日作》    ——白居易"
        ],
        "送别": [
            "《送友人南归》    ——王维",
            "《送王四十五归东都》    ——徐铉"
        ],
        "孤寂": [
            "《宿郑州》    ——王维"
        ],
        "愁苦": [],
        "忧国忧民": [
            "《兵车行》    ——杜甫",
            "《自京赴奉先县咏怀五百字 》    ——杜甫",
            "《岁晏行》    ——杜甫",
            "《秋兴八首》    ——杜甫",
            "《杜陵叟》    ——白居易"
        ],
        "咏史怀古": [
            "《古大梁行》    ——高适",
            "《金陵怀古》    ——许浑"
        ],
        "壮志难酬": [],
        "讽刺": [
            "《公子家 》    ——聂夷中",
            "《田家》    ——聂夷中"
        ]
    },
    "枫": {
        "爱情": [
            "《大堤曲》    ——李贺"
        ],
        "赞美": [],
        "友情": [
            "《送王昌龄之岭南》    ——孟浩然"
        ],
        "励志": [],
        "闲适": [],
        "抒怀": [
            "《南征》    ——杜甫"
        ],
        "思乡": [
            "《馀干旅舍》    ——刘长卿",
            "《枫桥夜泊 》    ——张继"
        ],
        "思念": [
            "《春江花月夜》    ——张若虚",
            "《江陵愁望寄子安 》    ——鱼玄机",
            "《秋兴八首·其一》    ——杜甫"
        ],
        "送别": [
            "《送康太守》    ——王维",
            "《送李少府贬峡中王少府贬长沙》    ——高适",
            "《秋日赴阙题潼关驿楼 》    ——许浑",
            "《谢亭送别》    ——许浑"
        ],
        "孤寂": [
            "《韦处士郊居》    ——雍陶"
        ],
        "愁苦": [
            "《题玉泉溪》    ——湘驿女子"
        ],
        "忧国忧民": [
            "《南征》    ——杜甫",
            "《秋兴八首》    ——杜甫",
            "《风疾舟中伏枕书怀三十六韵奉呈湖南亲友》    ——杜甫"
        ],
        "咏史怀古": [
            "《过三闾庙》    ——戴叔伦",
            "《金陵怀古》    ——司空曙",
            "《楚宫》    ——李商隐"
        ],
        "壮志难酬": [],
        "讽刺": []
    },
    "菊花": {
        "爱情": [],
        "赞美": [],
        "友情": [
            "《过故人庄》    ——孟浩然",
            "《宣州九日闻崔四侍御与宇文太守游敬亭余时登响山不同此赏醉后寄崔侍御》    ——李白",
            "《与梦得沽酒闲饮且约后期》    ——白居易"
        ],
        "励志": [
            "《始闻秋风》    ——刘禹锡"
        ],
        "闲适": [],
        "抒怀": [
            "《奉和圣制重阳赐会聊示所怀》    ——李泌",
            "《叹庭前甘菊花》    ——杜甫",
            "《秋怀十五首》    ——孟郊",
            "《菊花》    ——元稹"
        ],
        "思乡": [
            "《行军九日思长安故园》    ——岑参",
            "《闽中秋思》    ——杜荀鹤"
        ],
        "思念": [
            "《九日五首·其一》    ——杜甫",
            "《秋兴八首·其一》    ——杜甫"
        ],
        "送别": [],
        "孤寂": [
            "《早秋三首》    ——许浑"
        ],
        "愁苦": [
            "《与梦得沽酒闲饮且约后期》    ——白居易"
        ],
        "忧国忧民": [
            "《北征》    ——杜甫",
            "《秋兴八首》    ——杜甫"
        ],
        "咏史怀古": [],
        "壮志难酬": [],
        "讽刺": []
    },
    "稷": {
        "爱情": [],
        "赞美": [
            "《金陵新亭》    ——李白"
        ],
        "友情": [
            "《过故人庄》    ——孟浩然"
        ],
        "励志": [
            "《赠韦秘书子春二首》    ——李白"
        ],
        "闲适": [],
        "抒怀": [
            "《赠别王十七管记》    ——高适",
            "《喜达行在所三首》    ——杜甫"
        ],
        "思乡": [],
        "思念": [],
        "送别": [
            "《赠别王十七管记》    ——高适"
        ],
        "孤寂": [
            "《宿郑州》    ——王维"
        ],
        "愁苦": [],
        "忧国忧民": [
            "《自京赴奉先县咏怀五百字 》    ——杜甫"
        ],
        "咏史怀古": [
            "《金陵新亭》    ——李白",
            "《古大梁行》    ——高适",
            "《八骏图》    ——白居易",
            "《金陵怀古》    ——许浑"
        ],
        "壮志难酬": [],
        "讽刺": [
            "《诸将五首》    ——杜甫",
            "《八骏图》    ——白居易",
            "《为徐敬业讨武曌檄 》    ——骆宾王"
        ]
    },
    "大麻": {
        "爱情": [],
        "赞美": [
            "《读韩杜集》    ——杜牧"
        ],
        "友情": [
            "《过故人庄》    ——孟浩然",
            "《下途归石门旧居》    ——李白"
        ],
        "励志": [
            "《茅屋为秋风所破歌》    ——杜甫"
        ],
        "闲适": [],
        "抒怀": [
            "《马诗二十三首》    ——李贺",
            "《野歌》    ——李贺"
        ],
        "思乡": [
            "《渡河到清河作》    ——王维"
        ],
        "思念": [],
        "送别": [
            "《西岳云台歌送丹丘子》    ——李白"
        ],
        "孤寂": [],
        "愁苦": [],
        "忧国忧民": [
            "《茅屋为秋风所破歌》    ——杜甫",
            "《杜陵叟》    ——白居易",
            "《山中寡妇 》    ——杜荀鹤",
            "《蚕妇》    ——杜荀鹤"
        ],
        "咏史怀古": [],
        "壮志难酬": [],
        "讽刺": [
            "《蚕妇》    ——杜荀鹤"
        ]
    },
    "芦苇": {
        "爱情": [
            "《江南曲四首》    ——储光羲"
        ],
        "赞美": [
            "《天山雪歌送萧治归京》    ——岑参",
            "《陪裴使君登岳阳楼》    ——杜甫"
        ],
        "友情": [
            "《天山雪歌送萧治归京》    ——岑参",
            "《寄李十二白二十韵》    ——杜甫",
            "《客至》    ——杜甫",
            "《暮秋扬子江寄孟浩然》    ——刘昚虚"
        ],
        "励志": [],
        "闲适": [
            "《寒食城东即事》    ——王维"
        ],
        "抒怀": [
            "《江夏赠韦南陵冰》    ——李白",
            "《自淇涉黄河途中作十三首》    ——高适",
            "《野歌》    ——李贺",
            "《春日寄怀》    ——李商隐"
        ],
        "思乡": [
            "《夕次盱眙县》    ——韦应物",
            "《望月有感》    ——白居易",
            "《边城独望》    ——马戴"
        ],
        "思念": [
            "《题苜蓿峰寄家人》    ——岑参",
            "《暮秋扬子江寄孟浩然》    ——刘昚虚",
            "《夜上受降城闻笛》    ——李益",
            "《秋兴八首·其一》    ——杜甫"
        ],
        "送别": [
            "《送康太守》    ——王维",
            "《送刘昱》    ——李颀",
            "《天山雪歌送萧治归京》    ——岑参"
        ],
        "孤寂": [
            "《洞庭阻风》    ——许棠"
        ],
        "愁苦": [
            "《春日寄怀》    ——李商隐"
        ],
        "忧国忧民": [
            "《自淇涉黄河途中作十三首》    ——高适",
            "《秋兴八首》    ——杜甫",
            "《新丰折臂翁》    ——白居易"
        ],
        "咏史怀古": [
            "《西塞山怀古》    ——刘禹锡"
        ],
        "壮志难酬": [],
        "讽刺": [
            "《野望》    ——杜甫",
            "《牧童词》    ——李涉",
            "《塞上曲·其一》    ——王昌龄"
        ]
    }
}

var exp_plants = {
    '柳树': {
        '送别': '“柳”与“留”相谐，产生了以柳赠别和折柳<br/>寄远的风俗，亲人或友朋离别，折柳以表达对<br/>离别者的不舍之情。',
        '思乡': '人们离别时折柳相送，在思念亲人、怀念故友<br/>时也会折柳寄情，盼望早归。依依的柳丝、漫<br/>漫的柳絮，都寄托了世人的离愁别绪、苦苦相思。',
        '思念': '人们离别时折柳相送，在思念亲人、怀念故友<br/>时也会折柳寄情，盼望早归。依依的柳丝、漫<br/>漫的柳絮，都寄托了世人的离愁别绪、苦苦相思。',
        '孤寂': '柳絮飘忽不定，与游子飘零、分离时的离情别<br/>绪飞扬合拍，故“柳”常作示愁的凭借，以柳<br/>形容愁绪的绵长。',
        '愁苦': '柳絮飘忽不定，与游子飘零、分离时的离情别<br/>绪飞扬合拍，故“柳”常作示愁的凭借，以柳<br/>形容愁绪的绵长。',
        '爱情': '春柳婆娑袅娜，万缕柔丝，自古就被视为绵绵<br/>爱情的象征。赠柳既能传情，亦表示忠贞之爱<br/>。',
        '励志': '柳是春的象征，她带着春色，携着春风，把喜<br/>悦和清新带到了人间。',
        '闲适': '柳是春的象征，她带着春色，携着春风，把喜<br/>悦和清新带到了人间。',
        '抒怀': '柳是春的象征，她带着春色，携着春风，把喜<br/>悦和清新带到了人间。',
        '友情': '柳是春的象征，她带着春色，携着春风，把喜<br/>悦和清新带到了人间。',
        '赞美': '柳是春的象征，她带着春色，携着春风，把喜<br/>悦和清新带到了人间。',
        '忧国忧民': '柳不仅能表达诗人韶华易逝的人生感慨与风雨<br/>飘摇中的无限悲愁，更有邀宠取媚的小人意象<br/>、倔强的弱者形象与朴实无华的君子形象',
        '咏史怀古': '柳不仅能表达诗人韶华易逝的人生感慨与风雨<br/>飘摇中的无限悲愁，更有邀宠取媚的小人意象<br/>、倔强的弱者形象与朴实无华的君子形象',
        '壮志难酬': '柳不仅能表达诗人韶华易逝的人生感慨与风雨<br/>飘摇中的无限悲愁，更有邀宠取媚的小人意象<br/>、倔强的弱者形象与朴实无华的君子形象',
        '讽刺': '柳条低垂，因风起舞，是很美的。但在一些诗<br/>人看来，它却是摇摆不定的。因此，也赋予它<br/>得势小人这—意象。'
    },
    '桃李': {
        '爱情': '桃李通常在三四月间开花，春天桃李盛放，花<br/>开灼灼，生机盎然的、蓬勃向上。',
        '友情': '桃李通常在三四月间开花，春天桃李盛放，花<br/>开灼灼，生机盎然的、蓬勃向上。',
        '励志': '桃李通常在三四月间开花，春天桃李盛放，花<br/>开灼灼，生机盎然的、蓬勃向上。',
        '赞美': '桃李通常在三四月间开花，春天桃李盛放，花<br/>开灼灼，生机盎然的、蓬勃向上。',
        '思乡': '“忆那处园林，旧家桃李，知他别后，几度花<br/>开”。出门在外的游子看到桃李，就会联想起<br/>自家门前村口的桃树和李树，引发浓浓的思乡<br/>之情。',
        '思念': '“忆那处园林，旧家桃李，知他别后，几度花<br/>开”。出门在外的游子看到桃李，就会联想起<br/>自家门前村口的桃树和李树，引发浓浓的思乡<br/>之情。',
        '送别': '“忆那处园林，旧家桃李，知他别后，几度花<br/>开”。出门在外的游子看到桃李，就会联想起<br/>自家门前村口的桃树和李树，引发浓浓的思乡<br/>之情。',
        '忧国忧民': '桃花成为皇室间不可或缺的景致，“桃李”与<br/>宫廷贵妇之间存在密切联系。',
        '壮志难酬': '桃花成为皇室间不可或缺的景致，“桃李”与<br/>宫廷贵妇之间存在密切联系。',
        '讽刺': '桃花成为皇室间不可或缺的景致，“桃李”与<br/>宫廷贵妇之间存在密切联系。',
        '通用': '诗人用桃李指代美丽的女性，指代品质高洁的<br/>君子，或象征着报恩、报答或者善来善往、以<br/>礼相待等'
    },
    '茶': {
        '赞美': '诗人借春茶中蕴含的丰富生命力和朝气，应对<br/>死亡恐惧，并以积极平和的态度面对死亡，拥<br/>抱生命。',
        '励志': '诗人借春茶中蕴含的丰富生命力和朝气，应对<br/>死亡恐惧，并以积极平和的态度面对死亡，拥<br/>抱生命。',
        '愁苦': '诗人对生活中的不如意，借有散郁气功效的 <br/>“茶意象”，驱散内心的苦闷。',
        '咏史怀古': '诗人对生活中的不如意，借有散郁气功效的 <br/>“茶意象”，驱散内心的苦闷。',
        '壮志难酬': '诗人对生活中的不如意，借有散郁气功效的 <br/>“茶意象”，驱散内心的苦闷。',
        '闲适': '“茶意象”传达一种消闲避世、远离污浊、保<br/>持心灵纯洁性的心态，达到一种清静、恬淡、<br/>无为、乐观的心境。',
        '抒怀': '“茶意象”传达一种消闲避世、远离污浊、保<br/>持心灵纯洁性的心态，达到一种清静、恬淡、<br/>无为、乐观的心境。',
        '通用': '“喜茶”展现诗人悠然情致，体现诗人的淡泊<br/>情趣和处世哲学。“苦茶”多宣泄诗人郁郁不<br/>得志，世态炎凉、寂寞无聊、孤苦郁闷。<br/>“雅茶”表现茶之清幽，反映诗人对雅致精神境界<br/>的赞赏与追求。'
    },
    '莲': {
        '爱情': '荷花构成的清新明丽之美和人花相映所产生的<br/>美,纯真和浪漫，暗喻浪漫的爱情。',
        '励志': '在唐代的诗歌创作中，荷花意象逐渐成为了士<br/>大夫人格的象征，是高洁之志，淡泊之志的人<br/>格象征，孤芳自赏、遗世独立的人格象征，忠<br/>贞不移的人格象征。',
        '赞美': '在唐代的诗歌创作中，荷花意象逐渐成为了士<br/>大夫人格的象征，是高洁之志，淡泊之志的人<br/>格象征，孤芳自赏、遗世独立的人格象征，忠<br/>贞不移的人格象征。',
        '思念': '抒发思念之情的诗歌中，诗人往往以荷花作为<br/>自己的精神寄托，借荷花倾诉相思苦情，荷花<br/>中注入诗人澎湃的思绪，悲伤的情怀，还有那<br/>缠绵的思念。',
        '送别': '抒发思念之情的诗歌中，诗人往往以荷花作为<br/>自己的精神寄托，借荷花倾诉相思苦情，荷花<br/>中注入诗人澎湃的思绪，悲伤的情怀，还有那<br/>缠绵的思念。',
        '思乡': '抒发思念之情的诗歌中，诗人往往以荷花作为<br/>自己的精神寄托，借荷花倾诉相思苦情，荷花<br/>中注入诗人澎湃的思绪，悲伤的情怀，还有那<br/>缠绵的思念。',
        '友情': '抒发思念之情的诗歌中，诗人往往以荷花作为<br/>自己的精神寄托，借荷花倾诉相思苦情，荷花<br/>中注入诗人澎湃的思绪，悲伤的情怀，还有那<br/>缠绵的思念。',
        '抒怀': '在唐代的诗歌创作中，荷花意象逐渐成为了士<br/>大夫人格的象征，是高洁之志，淡泊之志的人<br/>格象征，孤芳自赏、遗世独立的人格象征，忠<br/>贞不移的人格象征。',
        '壮志难酬': '诗人借荷花来表达自己的高洁之志，与世无争<br/>、不同流合污，同时也强烈的反映出社会现实<br/>的黑暗与不公，感叹人生如梦，怀才不遇，命<br/>运多舛。',
        '讽刺': '诗人借荷花来表达自己的高洁之志，与世无争<br/>、不同流合污，同时也强烈的反映出社会现实<br/>的黑暗与不公，感叹人生如梦，怀才不遇，命<br/>运多舛。',
        '忧国忧民': '唐诗中“枯荷”、“败荷”、“残荷”、“秋<br/>荷”等意象，有的是悲伤之情的寄托，有的折<br/>射出国家的衰败，赋予了荷花诗歌新的审美内<br/>涵。',
        '愁苦': '唐诗中“枯荷”、“败荷”、“残荷”、“秋<br/>荷”等意象，有的是悲伤之情的寄托，有的折<br/>射出国家的衰败，赋予了荷花诗歌新的审美内<br/>涵。',
        '孤寂': '唐诗中“枯荷”、“败荷”、“残荷”、“秋<br/>荷”等意象，有的是悲伤之情的寄托，有的折<br/>射出国家的衰败，赋予了荷花诗歌新的审美内<br/>涵。',
        '咏史怀古': '唐诗中“枯荷”、“败荷”、“残荷”、“秋<br/>荷”等意象，有的是悲伤之情的寄托，有的折<br/>射出国家的衰败，赋予了荷花诗歌新的审美内<br/>涵。'
    },

    '梅': { '爱情': '江南的梅花正代表着春天，折梅远寄正是将江<br/>南之春都寄给友人，是诗人真挚的情谊。后代<br/>文人赋予梅花的情思的范围渐渐广泛，已不单<br/>单是表达友情，还有乡情。', '思念': '江南的梅花正代表着春天，折梅远寄正是将江<br/>南之春都寄给友人，是诗人真挚的情谊。后代<br/>文人赋予梅花的情思的范围渐渐广泛，已不单<br/>单是表达友情，还有乡情。', '友情': '江南的梅花正代表着春天，折梅远寄正是将江<br/>南之春都寄给友人，是诗人真挚的情谊。后代<br/>文人赋予梅花的情思的范围渐渐广泛，已不单<br/>单是表达友情，还有乡情。', '思乡': '江南的梅花正代表着春天，折梅远寄正是将江<br/>南之春都寄给友人，是诗人真挚的情谊。后代<br/>文人赋予梅花的情思的范围渐渐广泛，已不单<br/>单是表达友情，还有乡情。', '孤寂': '江南的梅花正代表着春天，折梅远寄正是将江<br/>南之春都寄给友人，是诗人真挚的情谊。后代<br/>文人赋予梅花的情思的范围渐渐广泛，已不单<br/>单是表达友情，还有乡情。', '送别': '江南的梅花正代表着春天，折梅远寄正是将江<br/>南之春都寄给友人，是诗人真挚的情谊。后代<br/>文人赋予梅花的情思的范围渐渐广泛，已不单<br/>单是表达友情，还有乡情。', '闲适': '梅花多生在山村幽谷等环境幽僻之地，又在冬<br/>余雪残之际盛开，有着与世无争之性，诗人将<br/>梅花视为隐士的象征，借梅花来表达自己归隐<br/>之心。', '抒怀': '梅花多生在山村幽谷等环境幽僻之地，又在冬<br/>余雪残之际盛开，有着与世无争之性，诗人将<br/>梅花视为隐士的象征，借梅花来表达自己归隐<br/>之心。', '赞美': '梅花在冬末盛开，在凌寒中留香，不与群芳争<br/>艳，故高洁脱俗是文人赋予梅花最多的内涵，<br/>表达自己高洁傲岸的品性操守。', '励志': '梅花在冬末盛开，在凌寒中留香，不与群芳争<br/>艳，故高洁脱俗是文人赋予梅花最多的内涵，<br/>表达自己高洁傲岸的品性操守。', '愁苦': '梅花凌寒怒放，不畏严寒，无惧霜雪，此特性<br/>乃群芳所不及。文人也正是抓住此特性，将梅<br/>花誉为生命的斗士，赋予其不屈的精神和顽强<br/>的斗志。', '忧国忧民': '梅花凌寒怒放，不畏严寒，无惧霜雪，此特性<br/>乃群芳所不及。文人也正是抓住此特性，将梅<br/>花誉为生命的斗士，赋予其不屈的精神和顽强<br/>的斗志。', '咏史怀古': '梅花凌寒怒放，不畏严寒，无惧霜雪，此特性<br/>乃群芳所不及。文人也正是抓住此特性，将梅<br/>花誉为生命的斗士，赋予其不屈的精神和顽强<br/>的斗志。', '壮志难酬': '梅花凌寒怒放，不畏严寒，无惧霜雪，此特性<br/>乃群芳所不及。文人也正是抓住此特性，将梅<br/>花誉为生命的斗士，赋予其不屈的精神和顽强<br/>的斗志。', '讽刺': '梅花凌寒怒放，不畏严寒，无惧霜雪，此特性<br/>乃群芳所不及。文人也正是抓住此特性，将梅<br/>花誉为生命的斗士，赋予其不屈的精神和顽强<br/>的斗志。' },
    "梁": {},
    "肉桂": {},
    "地钱": {},
    "稷": {},
    "大麻": {},
    '芦苇': { '通用': '秋季的芦苇变得苍黄不堪，蓬松的芦花在秋风<br/>中摇曳出几分诗意，象征悲秋伤怀。漫长的羁<br/>旅生涯中,芦苇让人想起家乡，表达对仕途的<br/>茫然未知，对家乡的绵绵思念。 整日与芦苇<br/>相伴的隐士则用其表达闲适隐逸。' },
    '菊花': { '通用': '菊花象征着素质高雅，品德优良。其秋天开放<br/>，不与争春，象征着隐逸超脱，淡泊名利，凌<br/>霜开放，象征着锐意进取，坚贞不屈。秋风萧<br/>瑟，菊象征着一种憔悴忧虑，悲伤愁苦。' },
    '枫': { '通用': '枫树多抒情主体悲哀的情思，用以表现忧伤、<br/>愁虑的情感。不论是送行惜别，还是思归怀人<br/>的作品，只要出现枫意象，境界就会飘不一片<br/>愁云惨雾。' },
    '稻': { '通用': '一种一年生的草本植物，分水稻和旱稻,，通<br/>常指水稻。多用于指代稻谷、粮食，象征丰收<br/>。' },
    '藜': { '通用': '一年生草本植物，茎直立，嫩叶可吃。诗中多<br/>用于指代粗劣的饭菜。' },
    '桐花': { '通用': '桐花是清明“节日”之花，宴乐游春、祭祀思<br/>念等社会习俗构成了桐花意象的文化内涵。桐<br/>花与文人的落寞寡合、高士的自惬自洽情怀分<br/>别相关。' },
    '梧桐': { '通用': '梧桐是引得凤凰来的高贵树种，是高洁的象征<br/>；雌雄同株，同生共死，是坚贞不渝的爱情的<br/>象征；是文人悲秋的情绪的载体，也是凄凉悲<br/>伤的离愁之苦、故园之恋、离国之悲的象征。<br/>' },
    '白茅': { '通用': '白茅，因花穗上密生白色柔毛而得名，白茅早<br/>在先秦被认为是一种圣物，一般在祭祀使用。<br/>民间则多用白茅表达爱意。' },
    '香蒲': { '通用': '多年生草本植物，也称蒲草。生长在水边或池<br/>沼内。叶狭长，夏季开花，形如蜡烛。蒲草生<br/>命力极其旺盛而遍布全国各地，象征坚韧、顽强。' },
    '竹': { '通用': '竹子外形笔直，外体有节，内里虚空，四季常<br/>青，不畏严寒。与人的正直高洁、虚心谦逊、<br/>坚韧顽强等特点相联系，被用作君子优秀品质<br/>的象征。竹子性凉，这很容易与人事的悲凉联<br/>系起来，是诗人孤寂情感的象征。' },
    '桑树': { '通用': '采桑养蚕是妇女主要的生产活动，桑的意象与<br/>女性紧紧地联系在一起。桑树长于乡野郊次，<br/>是田园乡村的标志。“桑”与“丧”音近，故<br/>有“前不栽桑”之说。' },
    '木樨': { '通用': '桂意象与八公典故有渊源，是充满诱惑力与魔<br/>力的象征。折桂的登科及第含义，桂象征功名<br/>利禄。桂与月亮关系紧密，引发诗人愁思与慨<br/>叹。' },
    '泽兰': { '通用': '泽兰是古代著名的香草，以香草喻君子，诗人<br/>多借泽兰表达对高尚纯洁、忠贞品德的追求。<br/>' },
    '飞蓬': { '通用': '飞蓬是枯后根断遇风飞旋的蓬草，在诗中比喻<br/>轻微的事物、蓬乱的头发等，多抒发诗人飘泊<br/>不定、居无定所的孤独飘零之感。' }

}